
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Django · Documentação Pattern</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="../styles/website.css">
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="database.html" />
    
    
    <link rel="prev" href="flask.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introdução
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="arduino.html">
            
                <a href="arduino.html">
            
                    
                    Arduino
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="kivy.html">
            
                <a href="kivy.html">
            
                    
                    Kivy
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="flask.html">
            
                <a href="flask.html">
            
                    
                    Flask
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5" data-path="django.html">
            
                <a href="django.html">
            
                    
                    Django
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="database.html">
            
                <a href="database.html">
            
                    
                    Database
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Django</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="django">Django</h2>
<blockquote>
<p style="text-align: justify;">Nesta se&#xE7;&#xE3;o podemos verificar todos os itens referentes a documenta&#xE7;&#xE3;o espec&#xED;fica do site construido com Django. Dentro da estrutura do projeto de integra&#xE7;&#xE3;o o site Django tem a fun&#xE7;&#xE3;o de fornecer uma interface que permita a visualiza&#xE7;&#xE3;o das decte&#xE7;&#xF5;es de movimento al&#xE9;m do registro de usu&#xE1;rios e altera&#xE7;&#xF5;es dos dados.</p>

</blockquote>
<p style="text-align: justify;">
A interface web foi constru&#xED;da para permitir aos usu&#xE1;rios a cria&#xE7;&#xE3;o de contas dentro do escopo do projeto, al&#xE9;m da visualiza&#xE7;&#xE3;o, altera&#xE7;&#xE3;o e exclus&#xE3;o de dados. Seu desenvolvimento foi realizado sobre o framework web Django, um framework para aplica&#xE7;&#xF5;es web gratuito e de c&#xF3;digo aberto, escrito em Python.
</p>

<p style="text-align: justify;">
Diferente do Flask o Django &#xE9; mais robusto e tr&#xE1;s em sua estrutura padr&#xE3;o um conjunto de configura&#xE7;&#xE3;os encapsuladas e j&#xE1; presentes no framework que no caso do Flask voc&#xEA; teria que instalar algum pacote para isso, por&#xE9;m no Django ele j&#xE1; tr&#xE1;s isso para voc&#xEA; e te deixa o trabalho apenas de realizar pequenas configura&#xE7;&#xF5;es como no caso do banco de dados.
</p>

<p style="text-align: justify;">
A estrutura de um projeto Django j&#xE1; &#xE9; bem definida e te permite criar mais de um aplicativo dentro da sua estrutura padr&#xE3;o, isso &#xE9; &#xF3;timo pensando em aplica&#xE7;&#xF5;es mais robustas que tem que se comunicar com diversos componentes para ofecere um servi&#xE7;o final para o cliente. Por&#xE9;m para projetos menores frameworks como o Flask pode se bem mais vi&#xE1;vel.
</p>

<p style="text-align: justify;">
Um ponto de destaque no Django &#xE9; sua grande comunidade,  talvez seja a maior comunidade entre os web frameworks python da atualidade, isso significa um maior suporte para novos desenvolvedores, uma quantidade maior de problemas resolvidos e documentados. Tudo isso acaba criando uma atratividade muito grande na comunidade de novos desenvolvedores.
</p>

<p>O c&#xF3;digo da parte web pode se encontrado no reposit&#xF3;rio <a href="https://github.com/sancozta/safetydjango" target="_blank">sancozta/safetydjango</a> no Github. Vamos agora explicar sua estrutura e como esse projeto foi dispon&#xED;bilizado na web atr&#xE1;ves da utiliza&#xE7;&#xE3;o da plataforma heroku.</p>
<h3 id="estrutura">Estrutura</h3>
<h4 id="polls">polls</h4>
<p>Aplica&#xE7;&#xE3;o criada dentro da estrutura do Django para criar a plataforma web onde foi desenvolvido todas as funcionalidades da parte web.</p>
<h4 id="project">project</h4>
<p>Essa pasta contem os arquivos de configura&#xE7;&#xF5;es gerais do Django, como sistemas de rotas entre as aplica&#xE7;&#xF5;es, configura&#xE7;&#xF5;es de bancos de dados utilizados pelos aplicativos como tamb&#xE9;m configura&#xE7;&#xF5;es gerais.</p>
<h4 id="staticfiles">staticfiles</h4>
<p>Pasta necess&#xE1;ria para que a aplica&#xE7;&#xE3;o esteja no padr&#xE3;o desejado pelo heroku para subir um aplicativo Django.</p>
<h4 id="templates">templates</h4>
<p>Cont&#xE9;m os templates padr&#xF5;es da interface interna do Django, &#xE9; criada pelo pr&#xF3;prio kickstart dos projetos Django. </p>
<h4 id="gitignore">.gitignore</h4>
<p>Arquivo onde &#xE9; colocado o nome dos arquivos e pastas que devem ser ignorados pelo git.</p>
<h4 id="managepy">manage.py</h4>
<p>Arquivo de inicializa&#xE7;&#xE3;o do Django.</p>
<h4 id="procfile">Procfile</h4>
<p>Arquivo necess&#xE1;rio para que nosso projeto seja identificado e instalado pelo heroku.</p>
<h4 id="readmemd">readme.md</h4>
<p>Arquivo que cont&#xE9;m os comandos b&#xE1;sicos para executar o projeto localmente.</p>
<h4 id="requirementstxt">requirements.txt</h4>
<p>Arquivo que cont&#xE9;m todos os pacotes necess&#xE1;rios para que o projeto seja executado.</p>
<h3 id="executando-a-aplica&#xE7;&#xE3;o">Executando a Aplica&#xE7;&#xE3;o</h3>
<p style="text-align: justify;">
Recomenda-se utilizar um terminal bash para facilitar o desenvolvimeto e cria&#xE7;&#xE3;o do ambiente local. Com isso ceritifique-se que seu ambiente tenha o python instalado e com o Django e pip instalados, com isso podemos prosseguir.
</p>

<h4 id="verificando-ambiente">Verificando Ambiente</h4>
<p>Voc&#xEA; pode verificar se o django esta instalada executando o seguinte comando, assim voc&#xEA; poder&#xE1; verificar a vers&#xE3;o do django instalada.</p>
<pre><code>python -m django --version
</code></pre><h4 id="criando-um-novo-projeto">Criando um Novo Projeto</h4>
<p>Para criar um novo projeto como django basta executa o comando abaixo, como j&#xE1; temos o projeto n&#xE3;o &#xE9; necess&#xE1;rio executar este comando.</p>
<pre><code>django-admin startproject project
</code></pre><h4 id="instalando-depend&#xEA;ncias">Instalando Depend&#xEA;ncias</h4>
<p>Entre na pasta do projeto e execute o seguinte comando para realizar a instala&#xE7;&#xE3;o dos pacotes necess&#xE1;rios.</p>
<pre><code>pip install -r requirements.txt
</code></pre><h4 id="preperando-o-ambiente">Preperando o Ambiente</h4>
<p style="text-align: justify;">
Ap&#xF3;s instalar os pacotes necess&#xE1;rios para o projeto, podemos agora utilizar o servidor local do python para trabalhar na nossa aplica&#xE7;&#xE3;o. Portanto dentro da pasta do nosso projeto execute o comando abaixo. Por padr&#xE3;o o servidor fica dispon&#xED;vel na porta 8000 mais isso pode ser alterado colocado o n&#xFA;mero da porta ap&#xF3;s o runserver.
</p>

<pre><code>python manage.py runserver
</code></pre><h4 id="utilizando-a-aplica&#xE7;&#xE3;o">Utilizando a Aplica&#xE7;&#xE3;o</h4>
<p>A aplica&#xE7;&#xE3;o disponibilizada consulta a api <a href="https://github.com/sancozta/safetyflask" target="_blank">sancozta/safetyflask</a> portanto verifique a documenta&#xE7;&#xE3;o da api antes de qualquer a&#xE7;&#xE3;o. Po&#xED;s o funcionamento deste aplicativo depende das respostas que a api fornece.</p>
<h3 id="deploy-no-heroku">Deploy no Heroku</h3>
<p style="text-align: justify;">
Primerio &#xE9; preciso que sua aplica&#xE7;&#xE3;o esteja em um reposit&#xF3;rio no GitHub para que esse tutorial te ajude, caso contr&#xE1;rio haver&#xE1; formas diferentes de se realizar isso. Caso sua aplica&#xE7;&#xE3;o j&#xE1; esteja no Github voc&#xEA; pode prosseguir.
</p>

<p style="text-align: justify;">
Para que tudo funcione corretamente &#xE9; necess&#xE1;rio que na raiz do seu projeto tenha um arquivo chamado <b>Procfile</b> com o seguinte c&#xF3;digo. Esse arquivo &#xE9; interpretado pelo heroku e facilita a prepara&#xE7;&#xE3;o do nosso ambiente para que nossa aplica&#xE7;&#xE3;o construinda com Django funcione perfeitalmente.
</p>

<pre><code>web: gunicorn project.wsgi
</code></pre><p>Para subir sua aplica&#xE7;&#xE3;o no heroku, primeiro &#xE9; necess&#xE1;rio ter um conta na plataforma <a href="https://heroku.com" target="_blank">Heroku</a>. Depois de j&#xE1; logado na conta
acesse criar novo aplicativo, escolha o nome da aplica&#xE7;&#xE3;o e ap&#xF3;s sua cria&#xE7;&#xE3;o vincule sua aplica&#xE7;&#xE3;o com o seu reposit&#xF3;rio do GitHub e realize o deploy.</p>
<p style="text-align: justify;">
Caso queira que sua aplica&#xE7;&#xE3;o seja atualizada automaticamente em todos os momentos que voc&#xEA; realizar um altera&#xE7;&#xE3;o no seu c&#xF3;digo basta ativar a fun&#xE7;&#xE3;o de deploy autom&#xE1;tico.
</p>

<p>Assim que voc&#xEA; cria um aplica&#xE7;&#xE3;o o Heroku dispon&#xED;biliza um DNS com o sufixo herokuapp.com. Por Exemplo ap&#xF3;s subir nossa aplica&#xE7;&#xE3;o para o heroku d&#xEA;mos o nome de safetydjango o heroku dispon&#xED;bilizou a aplica&#xE7;&#xE3;o no DNS <a href="https://safetydjango.herokuapp.com" target="_blank">safetydjango.herokuapp.com</a> podendo ser acessada pelos protocolos https e http.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="flask.html" class="navigation navigation-prev " aria-label="Previous page: Flask">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="database.html" class="navigation navigation-next " aria-label="Next page: Database">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Django","level":"1.5","depth":1,"next":{"title":"Database","level":"1.6","depth":1,"path":"markdown/database.md","ref":"markdown/database.md","articles":[]},"previous":{"title":"Flask","level":"1.4","depth":1,"path":"markdown/flask.md","ref":"markdown/flask.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageBreaksBefore":"/","margin.left":56,"headerTemplate":null,"margin.bottom":56,"paperSize":"a4","margin":{"right":62,"left":62,"top":56,"bottom":56},"fontSize":12,"fontFamily":"Ubuntu","margin.top":56,"footerTemplate":null,"chapterMark":"pagebreak","pageNumbers":false,"margin.right":56},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Documentação Pattern","links":{"about":null,"issues":null,"contribute":null,"sharing":{"google":null,"facebook":null,"twitter":null}},"gitbook":"*","description":"Documentação Pattern - Gitbook"},"file":{"path":"markdown/django.md","mtime":"2018-11-26T10:43:17.010Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-11-27T13:08:18.036Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

