
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Flask · Documentação Pattern</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="../styles/website.css">
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="django.html" />
    
    
    <link rel="prev" href="kivy.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introdução
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="arduino.html">
            
                <a href="arduino.html">
            
                    
                    Arduino
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="kivy.html">
            
                <a href="kivy.html">
            
                    
                    Kivy
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="flask.html">
            
                <a href="flask.html">
            
                    
                    Flask
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="django.html">
            
                <a href="django.html">
            
                    
                    Django
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="database.html">
            
                <a href="database.html">
            
                    
                    Database
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Flask</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="flask">Flask</h2>
<blockquote>
<p style="text-align: justify;">Nesta se&#xE7;&#xE3;o podemos verificar todos os itens referentes a documenta&#xE7;&#xE3;o especifica da api Flask. Dentro da estrutura do projeto de integra&#xE7;&#xE3;o a api tem um papel de grande import&#xE2;ncia pois tem o fun&#xE7;&#xE3;o de centralizar a&#xE7;&#xF5;es e registrar dados no nosso banco de dados.</p>

</blockquote>
<p style="text-align: justify;">
Sendo considerada junto com o banco um componente central dentro do esquema do projeto que foi desenhado inicialmente a api junto com o banco de dados foi contruida primeiro e esteve presente durante todo o desenvolvimento do projeto, tanto pela plataforma web com django como tamb&#xE9;m a aplica&#xE7;&#xE3;o mobile construida com kivy, assim tamb&#xE9;m como a decta&#xE7;&#xE3;o dos movimento do o arduino enviando registro para a api.
</p>

<p style="text-align: justify;">
Para construir a api foi utilizando o Flask que &#xE9; um web framework de c&#xF3;digo aberto lan&#xE7;ado em 2010 amplamente utilizado para Python. Seu funcionamento &#xE9; bastante granular e extensivo, onde os desenvolvedores podem construir o que quiserem apenas juntanto partes do seus componentes, tornando o Flask f&#xE1;cil de entender e usar.
</p>

<p style="text-align: justify;">
Seu desenvolvimento &#xE9; muito r&#xE1;pido e pode chegar a surpreender, seu c&#xF3;digo &#xE9; bastante simples &#xE9; bem organizado por se tratar da linguagem python que tem uma das caracteristicas do seu design pattern a indente&#xE7;&#xE3;o e poucas linhas de c&#xF3;digo comparadas a outras linguagens do mercado como java, c e php. A facilidade em integrar o banco de dados com a api n&#xE3;o foi um problema, pelo contr&#xE1;rio foi bastante r&#xE1;pida, ao contr&#xE1;rio de outros web frameworks, o Flask n&#xE3;o tem uma camada adicional de acesso ao banco de dados nem depende do ORM (Object-Relational Mapping).
</p>

<p style="text-align: justify;">
Outro ponto que podemos destacar no Flask foi sua simplicidade no trabalho com os verbos http tendo fun&#xE7;&#xF5;es bem simples e de f&#xE1;cil utiliza&#xE7;&#xE3;o no trabalho com esses verbos. Isso mostrou-se uma caracteristica de destaque que embora esteja presente em outros frameworks no Flask isso ganha um caracter bastante simplista durante o desenvolvimento.
</p>

<p style="text-align: justify;">
Outro ponto de destaque foi a cria&#xE7;&#xE3;o de um middleware de autentica&#xE7;&#xE3;o para todas a rotas, podendo validar tokens que s&#xE3;o enviados nas requisi&#xE7;&#xF5;es de maneira simples e com poucas linhas de c&#xF3;digo.
</p>

<p>O c&#xF3;digo da api pode se encontrado no reposit&#xF3;rio <a href="https://github.com/sancozta/safetyflask" target="_blank">sancozta/safetyflask</a> no Github. Vamos agora explicar sua estrutura e como esse projeto foi dispon&#xED;bilizado na web atr&#xE1;ves da utiliza&#xE7;&#xE3;o da plataforma heroku.</p>
<h3 id="estrutura">Estrutura</h3>
<h4 id="database">database</h4>
<p>Pasta onde cont&#xE9;m todos os dados para a cria&#xE7;&#xE3;o e entendimento do banco de dados utilizado pela api para registrado os dados da integra&#xE7;&#xE3;o.</p>
<h4 id="docs">docs</h4>
<p>Dentro desta pasta esta presente um arquivo .json que pode ser carregado no aplicativo Postman, voc&#xEA; pode fazer o download <a href="https://www.getpostman.com/apps" target="_blank">aqui</a>. Ao carregar esse arquivo no postman ser&#xE1; poss&#xED;vel visualizar todas a rotas que est&#xE3;o presentes na api e como testa-las. O postman &#xE9; um aplicativo muito utilizado em projeto que trabalham com webservices e pode ajudar muito nesses trabalhos.</p>
<h4 id="flaskr">flaskr</h4>
<p>Dentro desta pasta podemos visualizar o arquivo principal onde desenvolvemos todos as nossas rotas, o arquivo flaskr.py. Nele esta todas as rotas e
e as configura&#xE7;&#xF5;es para que o n&#xFA;cleo da api funcione.</p>
<h4 id="gitignore">.gitignore</h4>
<p>&#xC9; apenas um arquivo para que no reposit&#xF3;rio git n&#xE3;o seja versionado arquivos tempor&#xE1;rios.</p>
<h4 id="procfile">Procfile</h4>
<p>Esse arquivo &#xE9; imprescind&#xED;vel para hospedarmos nossa api na plataforma heroku, visto que ele &#xE9; respons&#xE1;vel por dizermos ao heroku como nossa aplica&#xE7;&#xE3;o deve ser tratada e qual tecnologia ela utiliza.</p>
<h4 id="readmemd">readme.md</h4>
<p>O arquivo readme.md cont&#xE9;m comando b&#xE1;sico para que qualquer desenvolvedor possa executar a aplica&#xE7;&#xE3;o localmente em sua m&#xE1;quina apenas com simples comandos.</p>
<h4 id="requirementstxt">requirements.txt</h4>
<p>Nesse arquivo podemos encontrar todos os pacotes necess&#xE1;rios para que a aplica&#xE7;&#xE3;o seja executada. Executando o comando de instala&#xE7;&#xE3;o todos os pacotes s&#xE3;o baixados, configurados e disponibilizados para a nossa aplica&#xE7;&#xE3;o.</p>
<h3 id="executando-a-aplica&#xE7;&#xE3;o">Executando a Aplica&#xE7;&#xE3;o</h3>
<p>Recomenda-se utilizar um terminal bash para facilitar o desenvolvimeto e cria&#xE7;&#xE3;o do ambiente local. Com isso ceritifique-se que seu ambiente tenha o python instalado e com o pip instalado, com isso podemos prosseguir. </p>
<h4 id="preperando-o-ambiente">Preperando o Ambiente</h4>
<p>Certifique-se que de baixar o projeto <a href="https://github.com/sancozta/safetyflask" target="_blank">sancozta/safetyflask</a> e que esteja dentro da pasta do projeto. 
Com isso execute os comandos a seguir no terminal bash.</p>
<pre><code>pip install virtualenv
virtualenv env
source env/bin/activate
</code></pre><h4 id="instalando-depend&#xEA;ncias">Instalando Depend&#xEA;ncias</h4>
<p>Ap&#xF3;s preparar o ambiente com o virtualenv execute o seguinte comando para baixar, configurar e disponibilizar o pacotes para a nossa aplica&#xE7;&#xE3;o.</p>
<pre><code>pip install -r requirements.txt
</code></pre><h4 id="determinando-path-do-diret&#xF3;rio">Determinando Path do Diret&#xF3;rio</h4>
<p>Com os pacotes instalado e dentro da pasta do projeto execute o seguinte comando. </p>
<pre><code>export FLASK_APP=flaskr/flaskr.py
</code></pre><h4 id="para-ambiente-de-desenvolvimento">Para Ambiente de Desenvolvimento</h4>
<p>Para ativar o modo debug do flask execute o comando abaixo, assim poderemos ver com maior n&#xED;vel de detalhes os erros do flask.</p>
<pre><code>export FLASK_DEBUG=true
</code></pre><h4 id="executando-projeto">Executando Projeto</h4>
<p>E por fim para executar o projeto localmente o flask nos permite subir um servidor local para facilitar nosso desenvolvimento, dispon&#xED;vel em <b>localhost:5000</b></p>
<pre><code>flask run
</code></pre><h3 id="deploy-no-heroku">Deploy no Heroku</h3>
<p style="text-align: justify;">
Primerio &#xE9; preciso que sua aplica&#xE7;&#xE3;o esteja em um reposit&#xF3;rio no GitHub para que esse tutorial te ajude, caso contr&#xE1;rio haver&#xE1; formas diferentes de se realizar isso. Caso sua aplica&#xE7;&#xE3;o j&#xE1; esteja no Github voc&#xEA; pode prosseguir.
</p>

<p style="text-align: justify;">
Para que tudo funcione corretamente &#xE9; necess&#xE1;rio que na raiz do seu projeto tenha um arquivo chamado <b>Procfile</b> com o seguinte c&#xF3;digo. Esse arquivo &#xE9; interpretado pelo heroku e facilita a prepara&#xE7;&#xE3;o do nosso ambiente para que nossa api construinda com flask funcione perfeitalmente.
</p>

<pre><code>web: gunicorn --chdir flaskr flaskr:app    
</code></pre><p>Para subir sua aplica&#xE7;&#xE3;o no heroku, primeiro &#xE9; necess&#xE1;rio ter um conta na plataforma <a href="https://heroku.com" target="_blank">Heroku</a>. Depois de j&#xE1; logado na conta
acesse criar novo aplicativo, escolha o nome da aplica&#xE7;&#xE3;o e ap&#xF3;s sua cria&#xE7;&#xE3;o vincule sua aplica&#xE7;&#xE3;o com o seu reposit&#xF3;rio do GitHub e realize o deploy.</p>
<p style="text-align: justify;">
Caso queira que sua aplica&#xE7;&#xE3;o seja atualizada automaticamente em todos os momentos que voc&#xEA; realizar um altera&#xE7;&#xE3;o no seu c&#xF3;digo basta ativar a fun&#xE7;&#xE3;o de deploy autom&#xE1;tico.
</p>

<p>Assim que voc&#xEA; cria um aplica&#xE7;&#xE3;o o Heroku dispon&#xED;biliza um DNS com o sufixo herokuapp.com. Por Exemplo ap&#xF3;s subir nossa aplica&#xE7;&#xE3;o para o heroku d&#xEA;mos o nome de safetyflask o heroku dispon&#xED;bilizou a aplica&#xE7;&#xE3;o no DNS <a href="https://safetyflask.herokuapp.com" target="_blank">safetyflask.herokuapp.com</a> podendo ser acessada pelos protocolos https e http.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="kivy.html" class="navigation navigation-prev " aria-label="Previous page: Kivy">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="django.html" class="navigation navigation-next " aria-label="Next page: Django">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Flask","level":"1.4","depth":1,"next":{"title":"Django","level":"1.5","depth":1,"path":"markdown/django.md","ref":"markdown/django.md","articles":[]},"previous":{"title":"Kivy","level":"1.3","depth":1,"path":"markdown/kivy.md","ref":"markdown/kivy.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageBreaksBefore":"/","margin.left":56,"headerTemplate":null,"margin.bottom":56,"paperSize":"a4","margin":{"right":62,"left":62,"top":56,"bottom":56},"fontSize":12,"fontFamily":"Ubuntu","margin.top":56,"footerTemplate":null,"chapterMark":"pagebreak","pageNumbers":false,"margin.right":56},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Documentação Pattern","links":{"about":null,"issues":null,"contribute":null,"sharing":{"google":null,"facebook":null,"twitter":null}},"gitbook":"*","description":"Documentação Pattern - Gitbook"},"file":{"path":"markdown/flask.md","mtime":"2018-11-26T10:43:17.010Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-11-27T13:08:18.036Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

